---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BRepBuilderPersistentIds Properties
BRepBuilderPersistentIds Class See Also Send Feedback
---

The BRepBuilderPersistentIds type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderPersistentIds Class

Autodesk.Revit.DB Namespace